/**
необходимо добавить три новые записи в татлицу book с двумя внешники ключами

+--------------+-------------+
| author_id PK | name_author |
+--------------+-------------+

+-------------+------------+
| genre_id PK | name_genre |
+-------------+------------+

+------------+-------+--------------+-------------+-------+--------+
| book_id PK | title | author_id FK | genre_id FK | price | amount |
+------------+-------+--------------+-------------+-------+--------+
**/

INSERT INTO book
VALUES (NULL, 'Стихотворения и поэмы', 3, 2, 650.00, 15),
    (NULL, 'Черный человек', 3, 2, 570.20, 6),
    (NULL, 'Лирика', 4, 2, 518.99, 2);