/**
Вывести информацию о книгах, написанных в самых популярных жанрах

Таблица genre:
+----------+-------------+
| genre_id | name_genre  |
+----------+-------------+
| 1        | Роман       |
| 2        | Поэзия      |
| 3        | Приключения |
+----------+-------------+

Таблица author:
+-----------+------------------+
| author_id | name_author      |
+-----------+------------------+
| 1         | Булгаков М.А.    |
| 2         | Достоевский Ф.М. |
| 3         | Есенин С.А.      |
| 4         | Пастернак Б.Л.   |
| 5         | Лермонтов М.Ю.   |
+-----------+------------------+

Таблица book:
+---------+-----------------------+-----------+----------+--------+--------+
| book_id | title                 | author_id | genre_id | price  | amount |
+---------+-----------------------+-----------+----------+--------+--------+
| 1       | Мастер и Маргарита    | 1         | 1        | 670.99 | 3      |
| 2       | Белая гвардия         | 1         | 1        | 540.50 | 5      |
| 3       | Братья Карамазовы     | 2         | 1        | 799.01 | 3      |
| 4       | Игрок                 | 2         | 1        | 480.50 | 10     |
| 5       | Стихотворения и поэмы | 3         | 2        | 650.00 | 15     |
| 6       | Черный человек        | 3         | 2        | 570.20 | 6      |
| 7       | Лирика                | 4         | 2        | 518.99 | 10     |
| 8       | Идиот                 | 2         | 1        | 460.00 | 10     |
| 9       | Герой нашего времени  | 5         | 3        | 570.59 | 2      |
| 10      | Доктор Живаго         | 4         | 3        | 740.50 | 5      |
+---------+-----------------------+-----------+----------+--------+--------+
**/

SELECT title,
    name_author,
    name_genre,
    price,
    amount
FROM book
    INNER JOIN author ON book.author_id = author.author_id
    INNER JOIN genre ON book.genre_id = genre.genre_id
WHERE name_genre IN (
    /** получаем названия самых популярных жанров **/
    SELECT name_genre
    FROM 
        book INNER JOIN genre
        ON book.genre_id = genre.genre_id
    GROUP BY book.genre_id
    HAVING SUM(amount) = ( 
        /** Получаем максимальное кол-во **/
        SELECT SUM(amount) AS max_count
        FROM book
        GROUP BY genre_id
        LIMIT 1
    )
)
ORDER BY title;