/**
Вывести, сколько попыток сделали студенты по каждой дисциплине
таблица attempt
+------------+------------+------------+--------------+--------+
| attempt_id | student_id | subject_id | date_attempt | result |
+------------+------------+------------+--------------+--------+
| 1          | 1          | 2          | 2020-03-23   | 67     |
| 2          | 3          | 1          | 2020-03-23   | 100    |
| 3          | 4          | 2          | 2020-03-26   | 0      |
| 4          | 1          | 1          | 2020-04-15   | 33     |
| 5          | 3          | 1          | 2020-04-15   | 67     |
| 6          | 4          | 2          | 2020-04-21   | 100    |
| 7          | 3          | 1          | 2020-05-17   | 33     |
+------------+------------+------------+--------------+--------+
таблица subject
+------------+-------------------+
| subject_id | name_subject      |
+------------+-------------------+
| 1          | Основы SQL        |
| 2          | Основы баз данных |
| 3          | Физика            |
+------------+-------------------+
**/

SELECT name_subject, COUNT(result) AS Количество, ROUND(AVG(result), 2) AS Среднее
FROM attempt
     RIGHT JOIN subject USING(subject_id)
GROUP BY name_subject
ORDER BY Среднее DESC;
