/**
Вывести студентов (различных студентов), имеющих максимальные результаты попыток
таблица attempt
+------------+------------+------------+--------------+--------+
| attempt_id | student_id | subject_id | date_attempt | result |
+------------+------------+------------+--------------+--------+
| 1          | 1          | 2          | 2020-03-23   | 67     |
| 2          | 3          | 1          | 2020-03-23   | 100    |
| 3          | 4          | 2          | 2020-03-26   | 0      |
| 4          | 1          | 1          | 2020-04-15   | 33     |
| 5          | 3          | 1          | 2020-04-15   | 67     |
| 6          | 4          | 2          | 2020-04-21   | 100    |
| 7          | 3          | 1          | 2020-05-17   | 33     |
+------------+------------+------------+--------------+--------+
таблица student
+------------+-----------------+
| student_id | name_student    |
+------------+-----------------+
| 1          | Баранов Павел   |
| 2          | Абрамова Катя   |
| 3          | Семенов Иван    |
| 4          | Яковлева Галина |
+------------+-----------------+
**/

SELECT name_student, result
FROM attempt
     INNER JOIN student USING(student_id)
WHERE result = (
    SELECT MAX(result)
    FROM attempt
)
ORDER BY name_student;
